natConvBox/case_599/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          599;
        startFace       716404;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          599;
        startFace       717003;
    }
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          599;
        startFace       717602;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          599;
        startFace       718201;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          717602;
        startFace       718800;
    }
)

// ************************************************************************* //
