natConvBox/case_599/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website   www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver petsc;

        petsc
        {
            options
            {
                ksp_type                    cg;
                ksp_cg_single_reduction     true;
                ksp_norm_type               none;
                pc_type                     bjacobi;
                sub_pc_type                 ilu;
                sub_pc_factor_levels        "2";
            }
            caching
            {
                matrix          auto;
                preconditioner  auto;
            }
        }

        tolerance       1e-7;
        relTol          1e-1;
    }

    "(U|T|k|epsilon|omega|f|v2)"
    {
        solver            petsc;
        tolerance       1e-7;
        relTol          1e-1;

        petsc
        {
            options
            {
                ksp_type                    bicg;
                pc_type                     bjacobi;
                sub_pc_type                 ilu;
                sub_pc_factor_levels        "2";
            }

            caching
            {
                matrix          auto;
                preconditioner  auto;
            }
        }
    }
}

SIMPLE
{

    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p_rgh           1e-2;
        "(U|Ux|Uy)"     1e-3;
        T               1e-3;
    }
}

relaxationFactors
{
    fields
    {
        p_rgh           0.5;
    }
    equations
    {
        "(U|Ux|Uy)"     0.8;
        T               0.9;
    }
}


// ************************************************************************* //
